In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={"NAME":['Niranjan','Kaviya','Regina','Sana'],"MARK":['80','85','90','95'],"CITY":['Bangalore','Coimbatore','Chennai','Madurai']}
df=pd.DataFrame(dict1)

In [3]:
df

       NAME MARK        CITY
0  Niranjan   80   Bangalore
1    Kaviya   85  Coimbatore
2    Regina   90     Chennai
3      Sana   95     Madurai

In [4]:
df.index=[1,2,3,4]

In [5]:
df

       NAME MARK        CITY
1  Niranjan   80   Bangalore
2    Kaviya   85  Coimbatore
3    Regina   90     Chennai
4      Sana   95     Madurai

In [6]:
ser=pd.Series(np.random.rand(20))

In [7]:
ser

0     0.185759
1     0.805987
2     0.374387
3     0.125148
4     0.947711
5     0.050196
6     0.676336
7     0.182353
8     0.206444
9     0.630371
10    0.241370
11    0.764758
12    0.232069
13    0.953047
14    0.815735
15    0.209812
16    0.826885
17    0.617601
18    0.757987
19    0.637928
dtype: float64

In [8]:
type(ser)

pandas.Series

In [9]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [10]:
newdf

            0         1         2         3         4
0    0.411388  0.989711  0.583663  0.611327  0.084064
1    0.042657  0.360830  0.905363  0.296916  0.784240
2    0.306010  0.357984  0.268825  0.436492  0.118503
3    0.871379  0.960492  0.376399  0.837865  0.790209
4    0.348836  0.272146  0.446059  0.149816  0.583587
..        ...       ...       ...       ...       ...
329  0.101173  0.197658  0.236011  0.578626  0.741368
330  0.595486  0.426542  0.979778  0.428642  0.909042
331  0.274227  0.645437  0.233968  0.993784  0.573058
332  0.314717  0.223604  0.656196  0.164829  0.266593
333  0.156549  0.456750  0.188443  0.475789  0.547465

[334 rows x 5 columns]

In [11]:
newdf.head(3)

          0         1         2         3         4
0  0.411388  0.989711  0.583663  0.611327  0.084064
1  0.042657  0.360830  0.905363  0.296916  0.784240
2  0.306010  0.357984  0.268825  0.436492  0.118503

In [12]:
newdf.tail(3)

            0         1         2         3         4
331  0.274227  0.645437  0.233968  0.993784  0.573058
332  0.314717  0.223604  0.656196  0.164829  0.266593
333  0.156549  0.456750  0.188443  0.475789  0.547465

In [13]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.411388  0.989711  0.583663  0.611327  0.084064
1    0.042657  0.360830  0.905363  0.296916  0.784240
2    0.306010  0.357984  0.268825  0.436492  0.118503
3    0.871379  0.960492  0.376399  0.837865  0.790209
4    0.348836  0.272146  0.446059  0.149816  0.583587
..        ...       ...       ...       ...       ...
329  0.101173  0.197658  0.236011  0.578626  0.741368
330  0.595486  0.426542  0.979778  0.428642  0.909042
331  0.274227  0.645437  0.233968  0.993784  0.573058
332  0.314717  0.223604  0.656196  0.164829  0.266593
333  0.156549  0.456750  0.188443  0.475789  0.547465

[334 rows x 5 columns]

In [14]:
newdf.drop(0,axis=1)

            1         2         3         4
0    0.989711  0.583663  0.611327  0.084064
1    0.360830  0.905363  0.296916  0.784240
2    0.357984  0.268825  0.436492  0.118503
3    0.960492  0.376399  0.837865  0.790209
4    0.272146  0.446059  0.149816  0.583587
..        ...       ...       ...       ...
329  0.197658  0.236011  0.578626  0.741368
330  0.426542  0.979778  0.428642  0.909042
331  0.645437  0.233968  0.993784  0.573058
332  0.223604  0.656196  0.164829  0.266593
333  0.456750  0.188443  0.475789  0.547465

[334 rows x 4 columns]

In [15]:
newdf.dropna(inplace=True)